# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
#brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
#brew 'stripe'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.4'
# brew 'php@7.2'
brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'nvm'
brew 'redis'
brew 'yarn'
brew 'nativefier'
brew 'youtube-dl'

# Apps
cask 'iterm2'
cask 'dropbox'
cask 'webpquicklook'
cask 'adobe-creative-cloud'
cask '1password'
cask '1password-cli'
#cask 'aerial'
#cask 'alfred'
#cask 'caffeine'
#cask 'dbngin'
cask 'discord'
cask 'docker'
#cask 'figma'
cask 'firefox'
#cask 'github'
#cask 'google-backup-and-sync'
cask 'google-chrome'
#cask 'gpg-suite'
cask 'imageoptim'
#cask 'insomnia'
#cask 'phpstorm'
#cask 'screenflow'
#cask 'skype'
cask 'slack'
#cask 'steam'
cask 'sublime-text'
#cask 'tableplus'
#cask 'telegram-desktop'
cask 'the-unarchiver'
#cask 'tinkerwell'
#cask 'transmission'
#cask 'transmit'
cask 'visual-studio-code'
#cask 'vlc'
#cask 'whatsapp'
cask 'sketch'
cask 'local'
cask 'rectangle'
cask 'zoomus'
cask 'cleanmymac'
cask 'itsycal'
cask 'lastfm'
cask 'gray'
cask 'lulu'
cask 'raindropio'
cask 'appcleaner'


# Quicklook
# cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'

# Mac App Store
#mas 'Byword', id: 420212497
#mas 'Giphy Capture', id: 668208984
#mas 'Keynote', id: 409183694
#mas 'Numbers', id: 409203825
#mas 'Spark', id: 1176895641
#mas 'Things', id: 904280696
#mas 'Tweetbot', id: 1384080005
mas 'Downlink', id: 1454269192
mas 'ToothFairy', id: 1191449274
mas 'Save to Raindrop.io', id: 1549370672
mas 'Hush Nag Blocker', id: 1544743900
mas 'Adblock for Safari', id: 1402042596
